# tap 'supermomonga/homebrew-splhack'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'rcmdnk/homebrew-rcmdnkcask'
tap 'splhack/homebrew-splhack'
tap 'universal-ctags/universal-ctags'

cask 'alfred'
cask 'android-file-transfer'
cask 'atom'
cask 'bettertouchtool'
cask 'chromedriver'
cask 'cyberduck'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'docker'
cask 'drawio'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'font-fontawesome'
cask 'font-ricty-diminished'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'google-earth-pro'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'kindle'
cask 'licecap'
cask 'mysqlworkbench'
cask 'ngrok'
# cask 'phantomjs' # TODO: 各環境でをunsintallしたら削除する done: yukimura's macbook
cask 'postman'
cask 'robo-3t'
cask 'rstudio'
cask 'sequel-pro-nightly'
cask 'skitch'
cask 'slack'
cask 'smart-scroll'
cask 'toggl'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
# cask 'xmind' # TODO: 各環境でunsintallしたら削除する done: yukimura's macbook
cask 'xquartz' # for wine

brew 'ansible'
brew 'awscli'
brew 'bat'
brew 'circleci'
brew 'cmigemo-mk', args: ['HEAD']
brew 'cscope'
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'graphviz'
brew 'heroku/brew/heroku'
brew 'hub'
brew 'imagemagick@6'
brew 'jq'
brew 'libiconv'
brew 'libxml2'
brew 'libxslt'
brew 'lua'
brew 'lua@5.1' # macvim-kaoriyaがlua lua@5.1両方必要そう
# brew 'macvim-kaoriya', args: ['HEAD' , 'with-lua', 'with-cscope']
brew 'mariadb-connector-c' # RのRMySQLで利用している模様
brew 'mas'
brew "mysql@5.6", link: true
# brew 'ndenv' # TODO: 各環境でnodebrewをunsintallしたら削除する done: mac-mini
brew 'nodenv'
# brew 'nodebrew' # TODO: 各環境でnodebrewをunsintallしたら削除する done: mac-mini
brew 'peco'
brew 'pkg-config'
brew 'pstree'
brew 'pyenv'
brew 'r'
brew 'rbenv'
brew 'redis'
brew 'rename'
# brew 'rsense'
brew 'ruby-build'
brew 'tig'
brew 'translate-shell'
brew 'tree'
brew 'universal-ctags', args: ['HEAD']
brew 'wget'
brew 'wine'
brew 'yarn', args: ['without-node']

mas 'giphy-capture-the-gif-maker', id: 668208984
