# tap 'supermomonga/homebrew-splhack'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'rcmdnk/homebrew-rcmdnkcask'
tap 'splhack/homebrew-splhack'
tap 'homebrew/cask-versions'
# tap 'universal-ctags/universal-ctags'

cask 'alfred'
cask 'android-file-transfer'
cask 'bettertouchtool'
cask 'chromedriver'
cask 'cyberduck'
cask 'dash'
cask 'db-browser-for-sqlite'
cask 'docker'
cask 'drawio'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'font-fontawesome'
# cask 'font-ricty-diminished' # TODO: font-hackgen-nertに移行できたら削除したい  brew uninstall font-ricty-diminished
cask 'font-hackgen-nerd'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'google-earth-pro'
cask 'google-japanese-ime'
cask 'iterm2'
# cask 'java'
cask 'karabiner-elements'
cask 'keycastr'
cask 'kindle'
cask 'licecap'
cask 'macvim'
cask 'mysqlworkbench'
cask 'ngrok'
cask 'nosql-workbench'
cask 'notion'
cask 'postman'
cask 'robo-3t'
cask 'rstudio'
cask 'sequel-ace'
# cask 'skitch' # TODO: 各環境削除したら、行を削除する
cask 'slack'
cask 'toggl-track'
cask 'vagrant'
# cask 'virtualbox'
cask 'visual-studio-code'
cask 'xquartz' # for wine

brew 'ansible'
brew 'awscli'
brew 'bat'
brew 'bash-completion'
brew 'gh'
brew 'circleci'
# brew 'cmigemo-mk', args: ['HEAD']
brew 'cscope'
brew 'deno'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'graphviz'
brew 'heroku/brew/heroku'
brew 'hub'
brew 'imagemagick@6'
brew 'jo'
brew 'jq'
brew 'libiconv'
brew 'libxml2'
brew 'libxslt'
brew 'lima'
brew 'lua'
brew 'lua@5.1' # macvim-kaoriyaがlua lua@5.1両方必要そう
brew 'mariadb-connector-c' # RのRMySQLで利用している模様
brew 'mas'
brew "mysql@5.7", link: true
brew 'nodenv'
brew 'pkg-config'
brew 'pstree'
brew 'pyenv'
brew 'r'
brew 'rbenv'
brew 'redis'
brew 'rename'
# brew 'rsense'
brew 'ruby-build'
brew 'terraformer'
brew 'tig'
brew 'translate-shell'
brew 'tree'
# brew 'universal-ctags', args: ['HEAD']
brew 'wget'
brew 'wine'
brew 'yarn', args: ['ignore-dependencies']

# 以下は、mas signin してからじゃないと使えません。
# NOTE: 2022/09/03 時点、mas signinがエラーになるため、コメントアウトしています。
# Error: This command is not supported on this macOS version due to changes in macOS. For more information see: https://github.com/mas-cli/mas#known-issues
# mas 'giphy-capture-the-gif-maker', id: 668208984
# mas 'monosnap', id: 540348655
