cask_args appdir: '/Applications'
# tap 'supermomonga/homebrew-splhack'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/dupes'
tap 'rcmdnk/homebrew-rcmdnkcask'
tap 'splhack/homebrew-splhack'
tap 'universal-ctags/universal-ctags'

cask 'alfred'
cask 'atom'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'drawio'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'font-ricty-diminished'
cask 'google-chrome'
cask 'google-earth-pro'
cask 'google-japanese-ime'
cask 'inkdrop'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'licecap'
cask 'postman'
cask 'robo-3t'
cask 'rodeo'
cask 'rstudio'
cask 'sequel-pro'
cask 'skitch'
cask 'slack'
cask 'sqlitebrowser'
cask 'toggldesktop'
cask 'vagrant'
cask 'virtualbox'
cask 'xmind'
cask 'xquartz' # for wine

brew 'ansible'
brew 'awscli'
brew 'cmigemo-mk', args: ['HEAD']
brew 'cscope'
brew 'gawk'
brew 'gcc'
brew 'git'
brew 'gnu-sed'
brew 'graphviz'
brew 'heroku-toolbelt'
brew 'imagemagick@6'
brew 'jq'
brew 'libiconv'
brew 'libxml2'
brew 'libxslt'
brew 'lua'
brew 'lua@5.1' # macvim-kaoriyaがlua lua@5.1両方必要そう
brew 'macvim-kaoriya', args: ['HEAD' , 'with-lua', 'with-cscope']
brew 'mariadb-connector-c' # RのRMySQLで利用している模様
brew 'mas'
brew 'mongodb'
brew 'mysql@5.6'
brew 'nodebrew'
brew 'peco'
brew 'phantomjs'
brew 'pkg-config'
brew 'pssh'
brew 'pyenv'
brew 'r'
brew 'rbenv'
brew 'redis'
brew 'rename'
# brew 'rsense'
brew 'ruby-build'
brew 'tig'
brew 'translate-shell'
brew 'wine'
brew 'yarn'

